#+TITLE: Emacs Config
#+PROPERTY:header-args :tangle ~/.emacs.d/init.el

** Org Mode

#+BEGIN_SRC emacs-lisp
(use-package org
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-edit-src-content-indentation 0
        org-highlight-latex-and-related '(latex)
        org-format-latex-options (plist-put org-format-latex-options :scale 1.50)
        org-indent-mode-turns-on-hiding-stars nil))
#+END_SRC

The =rom/org-mode-setup= function configures some org mode settings and runs when I enter an org buffer.

#+BEGIN_SRC emacs-lisp
(defun rom/org-mode-setup ()

  ;; header faces
  (set-face-attribute 'org-level-1 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-2 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-3 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-4 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-5 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-6 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-7 nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-level-8 nil :weight 'bold :height 1.0)

  ;; TODO and DONE faces
  (set-face-attribute 'org-done nil :weight 'bold :height 1.0 :slant 'normal)
  (set-face-attribute 'org-headline-done nil :weight 'bold :height 1.0)
  (set-face-attribute 'org-todo nil :weight 'bold :height 1.0 :slant 'normal)

  ;; custom prettify symbols alist
  (push '("#+TITLE: "        . "") prettify-symbols-alist)
  (push '("#+SUBTITLE: "     . "") prettify-symbols-alist)
  (push '("#+AUTHOR: "       . "-") prettify-symbols-alist)
  (push '(":PROPERTIES:"     . ":") prettify-symbols-alist)
  (push '("#+PROPERTY:"      . ":") prettify-symbols-alist)
  (push '("#+BEGIN_SRC"      . "λ") prettify-symbols-alist)
  (push '("#+END_SRC"        . "-") prettify-symbols-alist)
  (push '("#+RESULTS:"       . "»") prettify-symbols-alist)
  (push '(":end:"            . "-") prettify-symbols-alist)
  (push '(":results:"        . "-") prettify-symbols-alist)
  (push '("#+NAME:"          . "-") prettify-symbols-alist)
  (push '("#+BEGIN_EXAMPLE"  . "~") prettify-symbols-alist)
  (push '("#+END_EXAMPLE"    . "~") prettify-symbols-alist)
  (push '("#+BEGIN_VERBATIM" . "") prettify-symbols-alist)
  (push '("#+END_VERBATIM"   . "") prettify-symbols-alist)
  (push '("#+BEGIN_VERSE"    . "") prettify-symbols-alist)
  (push '("#+END_VERSE"      . "") prettify-symbols-alist)
  (push '("#+BEGIN_QUOTE"    . "") prettify-symbols-alist)
  (push '("#+END_QUOTE"      . "") prettify-symbols-alist)
  (push '("#+TBFLM:"         . "∫") prettify-symbols-alist)
  (push '("[X]"              . (?\[ (Br . Bl) ?✓ (Br . Bl) ?\])) prettify-symbols-alist)
  (push '("\\\\"             . "↩") prettify-symbols-alist)

  (visual-line-mode 1)
  (org-indent-mode 1))

(add-hook 'org-mode-hook 'rom/org-mode-setup)
 #+END_SRC

 #+RESULTS:
 | rom/org-mode-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] |

** Display buffers

I use a customized =display-buffer-alist=. This variable tells emacs how
to display buffers based on their name. My layout is configured to
work with three areas:

- *Main area* Used to display the documents/files I am editing. I can split normally
- *Bottom window* Used for shells, compilation outputs, ...
- *Side window* Used mainly for reference windows such as help/man pages (but also for other purposes)


#+BEGIN_SRC emacs-lisp
(setq display-buffer-alist `((,(rx "*" (or "help"
               "man"
               "WoMan"
               "bufler"
               "gud"))

          ;; display help buffers at the right
          (display-buffer-reuse-window display-buffer-in-side-window)
          (side . right)
          (window-width . 0.4))

         (,(rx "*" (or "vterm"
                       "shell"
                       "compilation"
                       "maxima"
                       "input"
                       "Python"
                       "KotlinREPL"
                       "scala"
                       "ielm"
                       "TeX"
                       "BackTrace"
                       "Warnings"
                       "Messages"
                       "Flycheck errors"
                      ))

          ;; display shell, compilation and error buffers at the bottom
          (display-buffer-reuse-window display-buffer-in-side-window)
          (side . bottom)
          (window-width . 10))))
#+END_SRC

#+RESULTS:
| \*\(?:WoMan\     | bufler\          | gud\        | help\     | man\)   | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right) | (window-width . 0.4) |           |         |         |            |         |         |                                                             |                 |                     |
| \*\(?:BackTrace\ | Flycheck errors\ | KotlinREPL\ | Messages\ | Python\ | TeX\                                                        | Warnings\      | compilation\         | i\(?:elm\ | nput\)\ | maxima\ | s\(?:cala\ | hell\)\ | vterm\) | (display-buffer-reuse-window display-buffer-in-side-window) | (side . bottom) | (window-width . 10) |

.
